cmsis-svd/cmsis-svd/data/Nuvoton/NUC029AE_v1.svd
       <register>
          <name>P0_IMD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>P0_IMD</displayName>
          <description>P0 Interrupt Mode Control</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMD</name>
              <description>Port 0-5 Pin [n] Edge or Level Detection Interrupt Mode Control\nIMD[n] bit is used to control the triggered interrupt is by level trigger or by edge trigger. If the interrupt is by edge trigger, the trigger source can be controlled by de-bounce. If the interrupt is by level trigger, the input source is sampled by one HCLK clock and generates the interrupt.\nNote2:\nP0_IMD[3:2] are reserved.\nP1_IMD[7:6], [1] are reserved.\nP2_IMD[7], [1:0] are reserved.\nP3_IMD[7], [3] are reserved.\nP4_IMD[5:0] are reserved.\nP5_IMD[7:6] are reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Edge trigger interrupt</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Level trigger interrupt</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>P0_IEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>P0_IEN</displayName>
          <description>P0 Interrupt Enable Control</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IF_EN</name>
              <description>Port 0-5 Pin [n] Interrupt Enabled by Input Falling Edge or Input Level Low\nIF_EN[n] is used to enable the interrupt for each of the corresponding input Px.n pin. Set bit to 1 also enable the pin wake-up function.\nWhen setting the IF_EB[n] bit to 1:\nIf the interrupt is level trigger (IMD[n] is 1), the input Px.n pin will generate the interrupt while this pin state is at low level.\nIf the interrupt is edge mode trigger (IMD[n] is 0), the input Px.n pin will generate the interrupt while this pin state changed from high to low.\nNote2:\nP0_IEN[19:18], [3:2] are reserved.\nP1_IEN[23:22], [17], [7:6], [1] are reserved.\nP2_IEN[23], [17:16], [7], [1:0] are reserved.\nP3_IEN[23], [19], [7], [3] are reserved.\nP4_IEN[21:16], [5:0] are reserved.\nP5_IEN[23:22], [7:6] are reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Px.n low level or high to low interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n low level or high to low interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IR_EN</name>
              <description>Port 0-5 Pin [n] Interrupt Enabled by Input Rising Edge or Input Level High\nIR_EN[n] bit is used to enable the interrupt for each of the corresponding input Px.n pin. Set bit to 1 also enable the pin wake-up function.\nWhen setting the IR_EN[n] bit to 1:\nIf the interrupt is level trigger (IMD[n] is 1), the input Px.n pin will generate the interrupt while this pin state is at high level.\nIf the interrupt is edge trigger (IMD[n] is 0), the input Px.n pin will generate the interrupt while this pin state changed from low to high.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Px.n level high or low to high interrupt Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n level high or low to high interrupt Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>P0_ISRC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>P0_ISRC</displayName>
          <description>P0 Interrupt Source Flag</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISRC</name>
              <description>Port 0-5 Pin [n] Interrupt Source Flag\nWrite :\nNote2:\nP0_ISRC[3:2] are reserved.\nP1_ISRC[7:6], [1] are reserved.\nP2_ISRC[7], [1:0] are reserved.\nP3_ISRC[7], [3] are reserved.\nP4_ISRC[5:0] are reserved.\nP5_ISRC[7:6] are reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No action.\nNo interrupt at Px.n</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Clear the corresponding pending interrupt.\nPx.n generates an interrupt</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P1_PMD</name>
          <displayName>P1_PMD</displayName>
          <description>P1 I/O Mode Control</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P1_OFFD</name>
          <displayName>P1_OFFD</displayName>
          <description>P1 Digital Input Path Disable Control</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P1_DOUT</name>
          <displayName>P1_DOUT</displayName>
          <description>P1 Data Output Value</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P1_DMASK</name>
          <displayName>P1_DMASK</displayName>
          <description>P1 Data Output Write Mask</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P1_PIN</name>
          <displayName>P1_PIN</displayName>
          <description>P1 Pin Value</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P1_DBEN</name>
          <displayName>P1_DBEN</displayName>
          <description>P1 De-bounce Enable Control</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P1_IMD</name>
          <displayName>P1_IMD</displayName>
          <description>P1 Interrupt Mode Control</description>
          <addressOffset>0x58</addressOffset>
       </register>
