cmsis-svd/cmsis-svd/data/Nuvoton/NUC029AE_v1.svd
       <register derivedFrom="P0_IEN">
          <name>P4_IEN</name>
          <displayName>P4_IEN</displayName>
          <description>P4 Interrupt Enable Control</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="P0_ISRC">
          <name>P4_ISRC</name>
          <displayName>P4_ISRC</displayName>
          <description>P4 Interrupt Source Flag</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P5_PMD</name>
          <displayName>P5_PMD</displayName>
          <description>P5 I/O Mode Control</description>
          <addressOffset>0x140</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P5_OFFD</name>
          <displayName>P5_OFFD</displayName>
          <description>P5 Digital Input Path Disable Control</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P5_DOUT</name>
          <displayName>P5_DOUT</displayName>
          <description>P5 Data Output Value</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P5_DMASK</name>
          <displayName>P5_DMASK</displayName>
          <description>P5 Data Output Write Mask</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P5_PIN</name>
          <displayName>P5_PIN</displayName>
          <description>P5 Pin Value</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P5_DBEN</name>
          <displayName>P5_DBEN</displayName>
          <description>P5 De-bounce Enable Control</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P5_IMD</name>
          <displayName>P5_IMD</displayName>
          <description>P5 Interrupt Mode Control</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="P0_IEN">
          <name>P5_IEN</name>
          <displayName>P5_IEN</displayName>
          <description>P5 Interrupt Enable Control</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="P0_ISRC">
          <name>P5_ISRC</name>
          <displayName>P5_ISRC</displayName>
          <description>P5 Interrupt Source Flag</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register>
          <name>DBNCECON</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DBNCECON</displayName>
          <description>Interrupt De-bounce Control</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBCLKSEL</name>
              <description>De-bounce Sampling Cycle Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBCLKSRC</name>
              <description>De-bounce Counter Clock Source Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>De-bounce counter clock source is the HCLK</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>De-bounce counter clock source is the 10 kHz internal low speed oscillator</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ICLK_ON</name>
              <description>Interrupt Clock On Mode\nNote: It is recommended to turn off this bit to save system power if no special application concern.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Edge detection circuit is active only if I/O pin corresponding Px_IEN bit is set to 1</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>All I/O pins edge detection circuit is always active after reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>P00_PDIO</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>P00_PDIO</displayName>
          <description>GPIO P0.0 Pin Data Input/Output</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P_PDIO</name>
              <description>GPIO Px.n Pin Data Iutput/Output\nWriting this bit can control one GPIO pin output value.\nNote2: The writing operation will not be affected by register Px_DMASK[n].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Corresponding GPIO pin set to low.\nCorresponding GPIO pin status is low</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Corresponding GPIO pin set to high.\nCorresponding GPIO pin status is high</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
