cmsis-svd/cmsis-svd/data/Nuvoton/NUC029AE_v1.svd
       <register>
          <name>TRGSTS0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TRGSTS0</displayName>
          <description>PWM Trigger Status Register 0</description>
          <addressOffset>0x70</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMR0FLAG_R</name>
              <description>ADC trigger flag by counting up to CMR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT0FLAG</name>
              <description>ADC trigger flag by  counting to CNR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMR0FLAG_F</name>
              <description>ADC trigger flag by counting down to CMR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERID0FLAG</name>
              <description>ADC trigger flag by period \nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMR1FLAG_R</name>
              <description>ADC trigger flag by counting up to CMR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT1FLAG</name>
              <description>ADC trigger flag by  counting to CNR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMR1FLAG_F</name>
              <description>ADC trigger flag by counting down to CMR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERID1FLAG</name>
              <description>ADC trigger flag by period \nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMR2FLAG_R</name>
              <description>ADC trigger flag by counting up to CMR \nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT2FLAG</name>
              <description>ADC trigger flag by  counting to CNR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMR2FLAG_F</name>
              <description>ADC trigger flag by counting down to CMR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERID2FLAG</name>
              <description>ADC trigger flag by period \nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMR3FLAG_R</name>
              <description>When counter counting up to CMR, this bit will be set for trigger ADC\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT3FLAG</name>
              <description>When counter counting to CNR, this bit will be set for trigger ADC\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMR3FLAG_F</name>
              <description>When counter counting down to CMR, this bit will be set for trigger ADC\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERID3FLAG</name>
              <description>When counter counting to period, this bit will be set for trigger ADC \nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>TRGSTS1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TRGSTS1</displayName>
          <description>PWM Trigger Status Register 1</description>
          <addressOffset>0x74</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMR4FLAG_R</name>
              <description>ADC trigger flag by counting up to CMR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT4FLAG</name>
              <description>ADC trigger flag by counting to CNR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMR4FLAG_F</name>
              <description>ADC trigger flag by counting down to CMR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERID4FLAG</name>
              <description>ADC trigger flag by period \nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMR5FLAG_R</name>
              <description>ADC trigger flag by counting up to CMR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT5FLAG</name>
              <description>ADC trigger flag by counting to CNR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMR5FLAG_F</name>
              <description>ADC trigger flag by counting down to CMR\nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERID5FLAG</name>
              <description>ADC trigger flag by period \nNote: Software can write 1 to clear this bit.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
